
## :white_check_mark: Apply Succeeded (dev)

[CI link](https://github.com/fumi-mura/infra_portfolio/actions/runs/14485954249)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.oidc_iam_policy.data.aws_iam_policy_document.this: Reading...
module.oidc_provider.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::598981015011:oidc-provider/token.actions.githubusercontent.com]
module.test_2_s3.aws_s3_bucket.this: Refreshing state... [id=dev-fumis-pf-test-2-s3-bucket]
module.test_1_s3.aws_s3_bucket.this: Refreshing state... [id=dev-fumis-pf-test-1-s3-bucket]
module.oidc_iam_policy.data.aws_iam_policy_document.this: Read complete after 0s [id=1789900679]
module.oidc_iam_policy.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::598981015011:policy/dev-fumis-pf-oidc-iam-policy]
module.oidc_iam_role.data.aws_iam_policy_document.assume_role: Reading...
module.oidc_iam_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3752914430]
module.oidc_iam_role.aws_iam_role.this: Refreshing state... [id=dev-fumis-pf-oidc-iam-role]
module.test_1_s3.aws_s3_bucket_versioning.this: Refreshing state... [id=dev-fumis-pf-test-1-s3-bucket]
module.test_1_s3.aws_s3_bucket_public_access_block.this: Refreshing state... [id=dev-fumis-pf-test-1-s3-bucket]
module.test_1_s3.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=dev-fumis-pf-test-1-s3-bucket]
module.test_2_s3.aws_s3_bucket_versioning.this: Refreshing state... [id=dev-fumis-pf-test-2-s3-bucket]
module.test_2_s3.aws_s3_bucket_public_access_block.this: Refreshing state... [id=dev-fumis-pf-test-2-s3-bucket]
module.test_2_s3.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=dev-fumis-pf-test-2-s3-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test_3_s3.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-fumis-pf-test-3-s3-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "dev-fumis-pf-test-3-s3-bucket"
        }
      + tags_all                    = {
          + "Environment"        = "dev"
          + "ManagedByTerraform" = "true"
          + "Name"               = "dev-fumis-pf-test-3-s3-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.test_3_s3.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.test_3_s3.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = "dev-fumis-pf-test-3-s3-bucket"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.test_3_s3.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
module.test_3_s3.aws_s3_bucket.this: Creating...
module.test_3_s3.aws_s3_bucket.this: Creation complete after 5s [id=dev-fumis-pf-test-3-s3-bucket]
module.test_3_s3.aws_s3_bucket_versioning.this: Creating...
module.test_3_s3.aws_s3_bucket_server_side_encryption_configuration.this: Creating...
module.test_3_s3.aws_s3_bucket_public_access_block.this: Creating...
module.test_3_s3.aws_s3_bucket_public_access_block.this: Creation complete after 1s [id=dev-fumis-pf-test-3-s3-bucket]
module.test_3_s3.aws_s3_bucket_server_side_encryption_configuration.this: Creation complete after 2s [id=dev-fumis-pf-test-3-s3-bucket]
module.test_3_s3.aws_s3_bucket_versioning.this: Creation complete after 2s [id=dev-fumis-pf-test-3-s3-bucket]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":31,"Program":"tfcmt","SHA1":"50523540f1d796942ae5f94d5610d5b650df9195","Target":"dev","Vars":{},"WorkflowName":"Apply"} -->